cr1901/msp430g2xx/svds/msp430g2x13.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USCI_A0_UART_MODE</name>
      <description>USCI_A0  UART Mode</description>
      <baseAddress>92</baseAddress>
      <registers>
        <register>
          <name>UCA0ABCTL</name>
          <description>USCI A0 LIN Control</description>
          <addressOffset>1</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>UCABDEN</name>
              <description>Auto Baud Rate detect enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCBTOE</name>
              <description>Break Timeout error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCSTOE</name>
              <description>Sync-Field Timeout error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCDELIM</name>
              <description>Break Sync Delimiter 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0IRTCTL</name>
          <description>USCI A0 IrDA Transmit Control</description>
          <addressOffset>2</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
          <fields>
            <field>
              <name>UCIREN</name>
              <description>IRDA Encoder/Decoder enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCIRTXCLK</name>
              <description>IRDA Transmit Pulse Clock Select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCIRTXPL</name>
              <description>IRDA Transmit Pulse Length 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0IRRCTL</name>
          <description>USCI A0 IrDA Receive Control</description>
          <addressOffset>3</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
          <fields>
            <field>
              <name>UCIRRXFE</name>
              <description>IRDA Receive Filter enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCIRRXPL</name>
              <description>IRDA Receive Input Polarity</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCIRRXFL</name>
              <description>IRDA Receive Filter Length 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0CTL0</name>
          <description>USCI A0 Control Register 0</description>
          <addressOffset>4</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>UCSYNC</name>
              <description>Sync-Mode  0:UART-Mode / 1:SPI-Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCMODE</name>
              <description>Async. Mode: USCI Mode 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCMODE_0</name>
                  <description>Sync. Mode: USCI Mode: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMODE_1</name>
                  <description>Sync. Mode: USCI Mode: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMODE_2</name>
                  <description>Sync. Mode: USCI Mode: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMODE_3</name>
                  <description>Sync. Mode: USCI Mode: 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCSPB</name>
              <description>Async. Mode: Stop Bits  0:one / 1: two</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UC7BIT</name>
              <description>Async. Mode: Data Bits  0:8-bits / 1:7-bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCMSB</name>
              <description>Async. Mode: MSB first  0:LSB / 1:MSB</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCPAR</name>
              <description>Async. Mode: Parity     0:odd / 1:even</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCPEN</name>
              <description>Async. Mode: Parity enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0CTL1</name>
          <description>USCI A0 Control Register 1</description>
          <addressOffset>5</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>UCSWRST</name>
              <description>USCI Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCTXBRK</name>
              <description>Send next Data as Break</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCTXADDR</name>
              <description>Send next Data as Address</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCDORM</name>
              <description>Dormant (Sleep) Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCBRKIE</name>
              <description>Break interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCRXEIE</name>
              <description>RX Error interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCSSEL</name>
              <description>USCI 0 Clock Source Select 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCSSEL_0</name>
                  <description>USCI 0 Clock Source: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSSEL_1</name>
                  <description>USCI 0 Clock Source: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSSEL_2</name>
                  <description>USCI 0 Clock Source: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSSEL_3</name>
                  <description>USCI 0 Clock Source: 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0BR0</name>
          <description>USCI A0 Baud Rate 0</description>
          <addressOffset>6</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>UCA0BR0</name>
              <description>USCI A0 Baud Rate 0 register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0BR1</name>
          <description>USCI A0 Baud Rate 1</description>
          <addressOffset>7</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>UCA0BR1</name>
              <description>USCI A0 Baud Rate 1 register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0MCTL</name>
          <description>USCI A0 Modulation Control</description>
          <addressOffset>8</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>UCOS16</name>
              <description>USCI 16-times Oversampling enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCBRS</name>
              <description>USCI Second Stage Modulation Select 2</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCBRS_0</name>
                  <description>USCI Second Stage Modulation: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRS_1</name>
                  <description>USCI Second Stage Modulation: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRS_2</name>
                  <description>USCI Second Stage Modulation: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRS_3</name>
                  <description>USCI Second Stage Modulation: 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRS_4</name>
                  <description>USCI Second Stage Modulation: 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRS_5</name>
                  <description>USCI Second Stage Modulation: 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRS_6</name>
                  <description>USCI Second Stage Modulation: 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRS_7</name>
                  <description>USCI Second Stage Modulation: 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCBRF</name>
              <description>USCI First Stage Modulation Select 3</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCBRF_0</name>
                  <description>USCI First Stage Modulation: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_1</name>
                  <description>USCI First Stage Modulation: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_2</name>
                  <description>USCI First Stage Modulation: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_3</name>
                  <description>USCI First Stage Modulation: 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_4</name>
                  <description>USCI First Stage Modulation: 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_5</name>
                  <description>USCI First Stage Modulation: 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_6</name>
                  <description>USCI First Stage Modulation: 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_7</name>
                  <description>USCI First Stage Modulation: 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_8</name>
                  <description>USCI First Stage Modulation: 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_9</name>
                  <description>USCI First Stage Modulation: 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_10</name>
                  <description>USCI First Stage Modulation: A</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_11</name>
                  <description>USCI First Stage Modulation: B</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_12</name>
                  <description>USCI First Stage Modulation: C</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_13</name>
                  <description>USCI First Stage Modulation: D</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_14</name>
                  <description>USCI First Stage Modulation: E</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_15</name>
                  <description>USCI First Stage Modulation: F</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0STAT</name>
          <description>USCI A0 Status Register</description>
          <addressOffset>9</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
          <fields>
            <field>
              <name>UCBUSY</name>
              <description>USCI Busy Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCADDR</name>
              <description>USCI Address received Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCRXERR</name>
              <description>USCI RX Error Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCBRK</name>
              <description>USCI Break received</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCPE</name>
              <description>USCI Parity Error Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCOE</name>
              <description>USCI Overrun Error Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCFE</name>
              <description>USCI Frame Error Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCLISTEN</name>
              <description>USCI Listen mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCIDLE</name>
              <description>Idle line detected</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0RXBUF</name>
          <description>USCI A0 Receive Buffer</description>
          <addressOffset>10</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>UCA0RXBUF</name>
              <description>USCI A0 Receive Buffer register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0TXBUF</name>
          <description>USCI A0 Transmit Buffer</description>
          <addressOffset>11</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>UCA0TXBUF</name>
              <description>USCI A0 Transmit Buffer register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
